export default function TermsOfService() {
  return (
    <>
      <div className="p-8 bg-white rounded-sm">
        <div className='text-sm md:text-md'>
          <h1 className='text-xl font-bold mb-1'>利用規約</h1>
          <p> この利用規約（以下，「本規約」といいます。）は，sales buddy（以下，「当運営者」といいます。）がこのウェブサイト上で提供するサービス（以下，「本サービス」といいます。）の利用条件を定めるものです。登録ユーザーの皆さま（以下，「ユーザー」といいます。）には，本規約に従って，本サービスをご利用いただきます。</p>

          <h2 className='text-lg mt-5'>第1条（適用）</h2>
          <ol>
            <li>1. 本規約は，ユーザーと当運営者との間の本サービスの利用に関わる一切の関係に適用されるものとします。</li>
            <li>2. 当サービスは本サービスに関し，本規約のほか，ご利用にあたってのルール等，各種の定め（以下，「個別規定」といいます。）をすることがあります。これら個別規定はその名称のいかんに関わらず，本規約の一部を構成するものとします。</li>
            <li>3. 本規約の規定が前条の個別規定の規定と矛盾する場合には，個別規定において特段の定めなき限り，個別規定の規定が優先されるものとします。</li>
          </ol>

          <h2 className='text-lg mt-2'>第2条（利用登録）</h2>
          <ol>
            <li>1. 本サービスにおいては、登録希望者が本規約に同意の上、LINEアカウントを使用してログインすることにより、利用登録が完了するものとします。</li>
            <li>2. 当運営者は、以下の事由があると判断した場合、利用登録を承認しないことがあり、その理由については一切の開示義務を負わないものとします。</li>
          </ol>
          <ol className='ml-3'>
            <li>a. 利用登録に際して虚偽の事項が提供された場合</li>
            <li>b. 本規約に違反したことがある者からの申請である場合</li>
            <li>c. その他、当運営者が利用登録を相当でないと判断した場合</li>
          </ol>

          <h2 className='text-lg mt-2'>第3条（アカウントの管理）</h2>
          <ol>
            <li>1. ユーザーは、自己の責任において、LINEアカウントを適切に管理するものとします。</li>
            <li>2. ユーザーは、いかなる場合にも、LINEアカウントを第三者に譲渡または貸与し、もしくは第三者と共用することはできません。当運営者は、LINEアカウントによって本サービスへログインされた場合には、そのユーザー自身による利用とみなします。</li>
            <li>3. LINEアカウントが第三者によって使用されたことによって生じた損害は、当運営者に故意または重大な過失がある場合を除き、当運営者は一切の責任を負わないものとします。</li>
          </ol>
          
          <h2 className='text-lg mt-2'>第4条（禁止事項）</h2>
          <ol>
            <li>1. 法令または公序良俗に違反する行為</li>
            <li>2. 犯罪行為に関連する行為</li>
            <li>3. 本サービスの内容等，本サービスに含まれる著作権，商標権ほか知的財産権を侵害する行為</li>
            <li>4. 当運営者，ほかのユーザー，またはその他第三者のサーバーまたはネットワークの機能を破壊したり，妨害したりする行為</li>
            <li>5. 本サービスによって得られた情報を商業的に利用する行為</li>
            <li>6. 当運営者のサービスの運営を妨害するおそれのある行為</li>
            <li>7. 不正アクセスをし，またはこれを試みる行為</li>
            <li>8. 他のユーザーに関する個人情報等を収集または蓄積する行為</li>
            <li>9. 不正な目的を持って本サービスを利用する行為</li>
            <li>10. 本サービスの他のユーザーまたはその他の第三者に不利益，損害，不快感を与える行為</li>
            <li>11. 他のユーザーに成りすます行為</li>
            <li>12. 当運営者が許諾しない本サービス上での宣伝，広告，勧誘，または営業行為</li>
            <li>13. 当サービスに関連して，反社会的勢力に対して直接または間接に利益を供与する行為</li>
            <li>14. その他，当運営者が不適切と判断する行為</li>
          </ol>

          <h2 className='text-lg mt-2'>第5条（本サービスの提供の停止等）</h2>
          <ol>
            <li>1. 当運営者は，以下のいずれかの事由があると判断した場合，ユーザーに事前に通知することなく本サービスの全部または一部の提供を停止または中断することができるものとします。</li>
            <ol className="ml-3">
              <li>a. 本サービスにかかるコンピュータシステムの保守点検または更新を行う場合</li>
              <li>b. 地震，落雷，火災，停電または天災などの不可抗力により，本サービスの提供が困難となった場合</li>
              <li>c. コンピュータまたは通信回線等が事故により停止した場合</li>
              <li>d. その他，当社が本サービスの提供が困難と判断した場合</li>
            </ol>
            <li>2. 当運営者は，本サービスの提供の停止または中断により，ユーザーまたは第三者が被ったいかなる不利益または損害についても，一切の責任を負わないものとします。</li>
          </ol>

          <h2 className='text-lg mt-2'>第6条（利用制限および登録抹消）</h2>
          <ol>
            <li>1. 当運営者は，ユーザーが以下のいずれかに該当する場合には，事前の通知なく，ユーザーに対して，本サービスの全部もしくは一部の利用を制限し，またはユーザーとしての登録を抹消することができるものとします。</li>
            <ol className="ml-3">
              <li>a. 本規約のいずれかの条項に違反した場合</li>
              <li>b. 登録事項に虚偽の事実があることが判明した場合</li>
              <li>c. 本サービスについて，最終の利用から一定期間利用がない場合</li>
              <li>d. その他，当社が本サービスの利用を適当でないと判断した場合</li>
            </ol>
            <li>2. 当運営者は，本条に基づき当社が行った行為によりユーザーに生じた損害について，一切の責任を負いません。</li>
          </ol>

          <h2 className='text-lg mt-2'>第7条（保証の否認および免責事項）</h2>
          <ol>
            <li>1. 当運営者は，本サービスに事実上または法律上の瑕疵（安全性，信頼性，正確性，完全性，有効性，特定の目的への適合性，セキュリティなどに関する欠陥，エラーやバグ，権利侵害などを含みます。）がないことを明示的にも黙示的にも保証しておりません。</li>
            <li>2. 当運営者は，本サービスに起因してユーザーに生じたあらゆる損害について、当社の故意又は重過失による場合を除き、一切の責任を負いません。ただし，本サービスに関する当社とユーザーとの間の契約（本規約を含みます。）が消費者契約法に定める消費者契約となる場合，この免責規定は適用されません。</li>
            <li>3. 前項ただし書に定める場合であっても、当運営者は、当運営者の過失（重過失を除きます。）による債務不履行または不法行為によりユーザーに生じた損害のうち特別な事情から生じた損害（当運営者またはユーザーが損害発生につき予見し、または予見し得た場合を含みます。）について一切の責任を負いません。</li>
            <li>4. 当運営者は、本サービスに関して、ユーザーと他のユーザーまたは第三者との間において生じた取引、連絡または紛争等について一切責任を負いません。</li>
          </ol>

          <h2 className='text-lg mt-2'>第8条（サービス内容の変更等）</h2>
          <p>当運営者は，ユーザーへの事前の告知をもって、本サービスの内容を変更、追加または廃止することがあり、ユーザーはこれを承諾するものとします。</p>

          <h2 className='text-lg mt-2'>第9条（利用規約の変更）</h2>
          <ol>
            <li>1. 当運営者は以下の場合には、ユーザーの個別の同意を要せず、本規約を変更することができるものとします。</li>
            <ol className="ml-3">
              <li>a. 本規約の変更がユーザーの一般の利益に適合するとき。</li>
              <li>b. 本規約の変更が本サービス利用契約の目的に反せず、かつ、変更の必要性、変更後の内容の相当性その他の変更に係る事情に照らして合理的なものであるとき。</li>
            </ol>
            <li>2. 当運営者はユーザーに対し、前項による本規約の変更にあたり、事前に、本規約を変更する旨及び変更後の本規約の内容並びにその効力発生時期を通知します。</li>
          </ol>

          <h2 className='text-lg mt-2'>第9条（個人情報の取扱い）</h2>
          <p>当運営者は，本サービスの利用によって取得する個人情報については，当サービス「プライバシーポリシー」に従い適切に取り扱うものとします。</p>

          <h2 className='text-lg mt-2'>第10条（通知）</h2>
          <p>ユーザーと当サービスとの間の通知または連絡は，当サービスの定める方法によって行うものとします。ユーザーから当サービスが別途定める方式に従った変更届け出がない限り,現在登録されている連絡先が有効なものとみなして当該LINEアカウントへ通知を行い,これらは発信時にユーザーへ到達したものとみなします。</p>

          <h2 className='text-lg mt-2'>第11条（権利義務の譲渡の禁止）</h2>
          <p>ユーザーは，当運営者の書面による事前の承諾なく，利用契約上の地位または本規約に基づく権利もしくは義務を第三者に譲渡し，または担保に供することはできません。</p>

          <h2 className='text-lg mt-2'>第12条（準拠法・裁判管轄）</h2>
          <p>本規約の解釈にあたっては，日本法を準拠法とします。</p>

          <p className="mt-2 text-right">以上</p>
        </div>
      </div>
    </>
  )
}
